
[
  
  
  {
    "objectID": "1622750982",
    "permalink": "/post/%E5%8D%97%E5%9B%BD%E7%BA%AA%E8%A1%8C%E4%BA%8C/",
    "title": "南国纪行（二）",
    
    "content": "\r前言\r虽然本篇的写作日期是2021-06-03，本来是打算在6月2日去深圳文和友玩了之后写的游记，但是紧跟着广东省的疫情出现，我不得不提前了回家的计划，紧接着的是办理各种离校手续，在6.9这天甚至出现了导员与学校领导关于是否让我们回哈尔滨的不同消息，闹了半天才真正解决。在此要十分感谢深圳校区辅导员辛老师的努力，在大学的三年时间里，第一次感受到了来自辅导员的关心与关怀，她是真正能把学生放在心上的辅导员老师，真的很尊敬她。\n这篇游记还是按照原计划写一写在深圳文和友的所见所闻吧，然后深圳的三个半月的生活体验写在下一篇纪行里面吧。\n现在是6月10日，我在机场附近的宾馆写下以上的文字，因为要赶明天早上7点半的飞机，所以今天也会睡的比较早吧。\n文和友\r文和友是一个长沙的综合商场的品牌，不过装修上很有特点，仿的是80 90年代的老长沙的风格，里面除了很多长沙地方特色的小吃，更多的是那个年代的一些独有的门店。 不过据老长沙人（DDJ）所说，长沙人基本上很少去文和友，导致文和友更像是一个外地人来长沙的打卡景点。四月文和友在深圳开了一家新店，茶颜悦色也入驻了，据说当天排号达到了5w多人，幽兰拿铁被炒到了300一杯，不过在我去的当天，由于前几日广州刚出现疫情，人不是很多，茶颜悦色排队也不到10人，基本上是去了就能点单，拍照也没有很多人，整体更像上个世纪的感觉了，总之是不错的体验。\n从大学城地铁站到老街站，需要转两次，花了快一个小时才到了门口，在地铁上我预约的座位，一直显示前方有98桌等待，我还以为要等到晚上，结果到了才发现，根本没有人，直接就进去了。\n进去是一个短短的走廊，一家花店和几家忘了是什么的店铺了，好像有一家豆浆店。\n进去后的一楼就是筒子楼的天井，中间是类似大排档的摊位，上方楼的墙壁上挂着大大小小的招牌，站在楼梯上看，颇有弄堂的内味了。\n一楼实在是太热了，我直接就去了二楼，二楼就凉快了很多，上楼梯之后就是一条曲曲折折的巷子，两侧是各式各样的老式店铺，主要是各种小吃和饮品。\n万年不主动和饮品的老直男也决定点一杯尝尝，选了店铺的招牌芝士芒芒，应该不会踩雷吧，店里面除了我之外并无顾客，真正的门可罗雀。和老板攀谈起来，老板说由于广州的疫情，最近一阵子根本没有人，文和友刚开业的时候排队可以到很远，很强的对比。我也不知这里的芝士芒芒是否正宗，下层是芒果肉捣成的泥混合着茶和沙冰，最上面一层芝 …",
    
    "date": "2021-06-03 20:09:42",
    "updated": "2021-06-03 20:09:42"
  }
  
  , 
  {
    "objectID": "1622750982",
    "permalink": "/post/%E6%95%B0%E6%8D%AE%E5%BA%93%E7%AC%94%E8%AE%B0/%E6%95%B0%E6%8D%AE%E5%BA%93%E7%AC%94%E8%AE%B0/",
    "title": "数据库笔记",
    
    "content": "\r前言\r深圳校区的《数据库系统》课程笔记。本部的数据库一直饱受诟病的是太依赖mooc了，不是说mooc不好，计算机本来就是一门发展极快的学科，mooc一录用好几年的情况实在不适合用在计算机学科上，我们希望能学到最新的知识，或者能与当前的技术做结合，第一节课之后，觉得深圳这边讲课的拓展比本部好很多。希望在这边能学到在本部学不到的知识。\n一、数据库系统基本概念\rTable的常用语： 列/字段/属性/数据项 行/元组/记录 表标题（格式） 表内容（值） Table中描述了一批相互有关联关系的数据$\\rightarrow$关系。第二章中给以严格定义：关系模型与关系运算\n数据库：相互之间有关联关系的Table的集合\n数据库系统(工作环境) 数据库(DB): Database 数据库管理系统(DBMS): Database Management System 数据库应用(DBAP): DataBase Application\n数据库管理员(DBA): DataBase Administrator\n计算机基本系统 数据库管理系统不包括数据库管理员，数据库系统包括数据库管理员。\n数据库管理系统(系统软件):从用户角度看DBMS的功能\n数据库定义: 定义数据库中Table的名称、标题(内含的属性名称及对该属性的值的要求)等。\nDBMS提供一套数据定义语言(DDL:Data Definition Language)给用户； 用户使用DDL描述其所要建立表的格式； DBMS依照用户的定义，创建数据库及其中的Table。 数据库操纵: 向数据库的Table中增加/删除/更新数据及对数据进行查询、 检索、统计等。\nDBMS提供一套数据操纵语言(DML:Data Manipulation Language)给用户； 用户使用DML描述其所要进行的增、删、改、查等操作； DBMS依照用户的操作描述，实际执行这些操作。 数据库控制: 控制数据库中数据的使用\u0026amp;mdash;哪些用户可以使用,哪些不可以 DBMS提供一套数据控制语言(DCL:Data Control Language)给用户\n用户使用DCL描述其对数据库所要实施的控制 DBMS依照用户的描述，实际进行控制 数据库维护: 转储/恢复/重组/性能监测/分析…\nDBMS提供一系列程序(实用程序/例行程序) 给用户 在这些程序中提供了对数据库维 …",
    
    "date": "2021-06-03 20:09:42",
    "updated": "2021-06-03 20:09:42"
  }
  
]